#!/usr/bin/env python 
# -*- coding:utf-8 -*- 

msgdict = {} 

msgdict[0] = '操作成功' 

msgdict[10007001] = '账号重复登录' 

msgdict[10007002] = '服务器即将维护' 

msgdict[10007003] = '服务器正在维护中，请稍后登录' 

msgdict[11003001] = '修改昵称失败, 存在非法字符' 

msgdict[11012001] = '昵称重复，无法修改' 

msgdict[11014001] = '您正在斗地主牌局中，点击确定继续牌局' 

msgdict[11014002] = '您正在聚宝阁游戏中，请等待结算后再进行该操作' 

msgdict[11014003] = '您正在进行百人大战游戏，请等待结算后再进行该操作' 

msgdict[11014004] = '您正在进行飞禽走兽游戏，请等待结算后再进行该操作' 

msgdict[11014005] = '进入聚宝阁游戏，vip等级不够，未开启系统' 

msgdict[11014006] = '进入聚宝阁游戏，英雄数量不足，未开启系统' 

msgdict[11014007] = '您正在进行疯狂对决游戏，请等待结算后再进行该操作' 

msgdict[11015001] = '领取vip奖励' 

msgdict[11037001] = '真实姓名不能为空' 

msgdict[11037002] = '该手机号绑定的账号数量过多' 

msgdict[11037003] = '账号安全中心绑定手机号，sdk返回错误' 

msgdict[11038001] = '身份证号不能为空' 

msgdict[11038002] = '身份证号跟绑定不一致' 

msgdict[11038003] = '输入手机号和当前绑定手机号不一致' 

msgdict[11039001] = '再次输入二级密码不能为空' 

msgdict[11039002] = '手机号不能为空' 

msgdict[11039003] = '两次密码不一致' 

msgdict[11039004] = '二级密码只允许6-10位' 

msgdict[11041001] = '二级密码校验错误' 

msgdict[11041002] = '二级密码不能为空' 

msgdict[11042001] = '该账户还未绑定账号安全中心信息' 

msgdict[11044001] = '登陆密码不能为空' 

msgdict[11044002] = '再次输入登陆密码不能为空' 

msgdict[11044003] = '两次登陆密码不一致' 

msgdict[11044004] = '登陆密码只允许6-20位' 

msgdict[11044005] = '修改登录密码错误，请稍后再试' 

msgdict[14003001] = '当铺兑换道具不足' 

msgdict[14003002] = '当铺兑换商品库存不足' 

msgdict[14003003] = '使用了不可参与兑换的道具' 

msgdict[15003001] = '今日已领取过超值礼包奖励' 

msgdict[15003002] = '超值礼包已过期' 

msgdict[16000001] = '斗地主房间不存在' 

msgdict[16000002] = '进房间时金币不足' 

msgdict[16000003] = '进房间时金币超出限制' 

msgdict[16000004] = '斗地主房间进入失败' 

msgdict[16000005] = '抢地主失败' 

msgdict[16000006] = '加倍失败' 

msgdict[16000007] = '金币不足时加倍' 

msgdict[16000008] = '超级加倍次数不足' 

msgdict[16000009] = '明牌失败' 

msgdict[16000010] = '出牌失败' 

msgdict[16000011] = '操作失败提示' 

msgdict[16000012] = '不在牌局中' 

msgdict[16000013] = '魔法表情金币限制' 

msgdict[16000014] = '出牌失败提示1' 

msgdict[16000015] = '出牌失败提示2' 

msgdict[16000016] = '出牌失败提示3' 

msgdict[16000017] = '出牌失败提示4' 

msgdict[16000018] = '未选中正确牌型时点击出牌' 

msgdict[16000019] = '错误提示' 

msgdict[16000020] = '比赛场进入失败' 

msgdict[16000021] = '比赛场报名失败' 

msgdict[16000022] = '比赛场报名失败' 

msgdict[16000023] = '比赛场报名失败' 

msgdict[16000024] = '取消比赛场报名失败，没有报名' 

msgdict[16000025] = '取消比赛场报名失败，已经开始比赛' 

msgdict[16000026] = '金币不足时使用记牌器' 

msgdict[16000027] = '已经使用过记牌器' 

msgdict[16000028] = '无英雄进英雄场' 

msgdict[16000029] = '非英雄场，不能使用技能' 

msgdict[16000030] = '英雄没有此技能' 

msgdict[16000031] = '已经使用过此技能' 

msgdict[16000032] = '当前状态不能使用技能' 

msgdict[16000033] = '换底牌失败，没有适合的牌' 

msgdict[16000034] = '换癞子牌失败，没有适合的牌' 

msgdict[16000035] = '牌处于冰封状态，无法打出' 

msgdict[17001001] = '玩家中途退出' 

msgdict[17002001] = '物品不足' 

msgdict[17002002] = '押注道具达上限' 

msgdict[17002003] = '押注总数达到上限' 

msgdict[17002004] = '当前无法押道具' 

msgdict[17002005] = '房间数据异常' 

msgdict[17002006] = '玩家数据异常' 

msgdict[17002007] = '参赛人数达到上限' 

msgdict[17002008] = '金币不足' 

msgdict[17014001] = '天降祥瑞，奖励已被领取' 

msgdict[17014002] = '天降祥瑞，活动已结束' 

msgdict[17014003] = '天降祥瑞，不在聚宝阁中' 

msgdict[18002001] = '商行上架物品已达上限' 

msgdict[18002002] = '留言长度超过上限' 

msgdict[18002003] = '上架时手续费不够' 

msgdict[18002004] = '上架物品数量不足' 

msgdict[18002005] = '非法贩卖金额' 

msgdict[18002006] = '贩卖数量必须大于0' 

msgdict[18002007] = '贩卖金额不合理' 

msgdict[18003001] = '下架物品已售出' 

msgdict[18004001] = '购买已售出的物品' 

msgdict[18004002] = '购买道具时金币不足' 

msgdict[18004003] = '无法购买自身贩卖的商品' 

msgdict[18006001] = '回收的商品不存在' 

msgdict[18007001] = '领取的商品不存在' 

msgdict[18007002] = '商品还没卖出' 

msgdict[18008001] = '赠送时物品不足' 

msgdict[18008002] = '非法目标ID，赠送失败' 

msgdict[18008003] = '今日赠送次数已用完' 

msgdict[18008004] = '物品装备中，无法赠送' 

msgdict[13002001] = '物品不足' 

msgdict[13002002] = '开宝箱时金币不足' 

msgdict[13002003] = 'VIP等级不够' 

msgdict[13002004] = '物品过期' 

msgdict[13002005] = '开宝箱时,物品不是宝箱' 

msgdict[13002006] = '精炼石不足' 

msgdict[13002007] = '精炼石不存在' 

msgdict[13003001] = '物品不足' 

msgdict[13003002] = '装备非皮肤道具时' 

msgdict[13003003] = 'VIP等级不够' 

msgdict[13003004] = '物品过期' 

msgdict[13003005] = '已经装备了相同的皮肤' 

msgdict[13004001] = '没有装备该物品' 

msgdict[13007001] = '合成材料不足' 

msgdict[13007002] = '该物品不能合成' 

msgdict[13007003] = '合成石不足' 

msgdict[13007004] = '幸运符不足' 

msgdict[13007005] = '该英雄已达最高等级' 

msgdict[13007006] = '不能合成已经装备的皮肤' 

msgdict[13007007] = '金币不足' 

msgdict[13007008] = '合成失败, 扣除部分英雄皮肤' 

msgdict[13009001] = '该物品不能夺宝' 

msgdict[13009002] = '保护符不足' 

msgdict[13009003] = '兑换失败(没有使用保护符)' 

msgdict[13009004] = '物品不足' 

msgdict[13009005] = '金币不足' 

msgdict[13009006] = 'VIP等级不够, 不可熔炼' 

msgdict[13009007] = '兑换失败(使用了保护符)' 

msgdict[13010001] = '物品不足' 

msgdict[20001001] = '已经发放完所有系统补偿' 

msgdict[20001002] = '还没达到系统补偿最低金额' 

msgdict[20002001] = '今日每日奖励已经领取' 

msgdict[20003001] = '已经领取所有VIP奖励' 

msgdict[20003002] = '金币不足，无法抽奖' 

msgdict[20004001] = '未到领取时间' 

msgdict[22000001] = '您每天可以进行10局游戏' 

msgdict[22000002] = '百人大战每天最多只能赢2000金币' 

msgdict[22000003] = '金币不足，不能进入游戏' 

msgdict[22001001] = '百人大战今日赢钱已达上限, 请明日再来' 

msgdict[22001002] = '百人大战今日输钱已达上限，请明日再来' 

msgdict[22001003] = '至少需要3W金币才能进入百人大战' 

msgdict[22003001] = '金币不足，无法上座' 

msgdict[22003002] = '该座位已被抢占' 

msgdict[22003003] = '非法上座位置' 

msgdict[22003004] = '已经在座位' 

msgdict[22003005] = '庄家不能上座' 

msgdict[22005001] = '非法押注数据' 

msgdict[22005002] = '押注速度过快' 

msgdict[22005003] = '总投注额已达庄家上限' 

msgdict[22005004] = '不在押注时间内中' 

msgdict[22005005] = '庄家不能进行押注' 

msgdict[22005006] = '单区域玩家押注上限300万' 

msgdict[22005007] = '剩余金币少于可押注的金币限制' 

msgdict[22006001] = '金币不足，无法上庄' 

msgdict[22006002] = '上庄队列已满，请稍候再试' 

msgdict[22006003] = '已经是庄家了' 

msgdict[22006004] = '携带金币超过上限' 

msgdict[22006005] = '已经申请过' 

msgdict[22006006] = '上庄卡不足' 

msgdict[22017001] = '金币不足，您已下庄!' 

msgdict[22017002] = '连庄次数已达最大次数，您已下庄!' 

msgdict[22017003] = '您的金币低于上庄要求，已取消上庄资格!' 

msgdict[21000001] = '玩家数据异常' 

msgdict[21000002] = '房间数据异常' 

msgdict[21000003] = '金币不足，不能进入游戏' 

msgdict[21001001] = '房间数据异常' 

msgdict[21001002] = '没有加入该房间' 

msgdict[21001003] = '中途退出游戏' 

msgdict[21002001] = '庄家不可押注' 

msgdict[21002002] = '金币不足' 

msgdict[21002003] = '不在押注状态' 

msgdict[21002004] = '玩家数据异常' 

msgdict[21002005] = '房间数据异常' 

msgdict[21002006] = '配置表数据异常' 

msgdict[21002007] = '单押超出限制时' 

msgdict[21002008] = '进行续押操作，有押注区已经达到限制时' 

msgdict[21002009] = '剩余金币少于可押注的金币限制' 

msgdict[21004001] = '重复申请' 

msgdict[21004002] = '申请列表已达上限' 

msgdict[21004003] = '金币不足' 

msgdict[21004004] = '已经是庄家' 

msgdict[21004005] = '房间数据异常' 

msgdict[21004006] = '玩家数据异常' 

msgdict[21004007] = '配置表数据异常' 

msgdict[21005001] = '连庄次数已达上限' 

msgdict[21005002] = '金币不足，自动下庄' 

msgdict[21005003] = '金币不足，不能成为庄家' 

msgdict[21005004] = '不是庄家' 

msgdict[21005005] = '提前下庄' 

msgdict[21005006] = '没有申请申请' 

msgdict[23002001] = '非法任务ID' 

msgdict[23002002] = '该任务未完成，无法领取奖励' 

msgdict[23002003] = '该任务已领取奖励' 

msgdict[23003001] = '金钱不足，无法刷新' 

msgdict[23003002] = '今日完成挑战任务次数已达上限' 

msgdict[23004001] = '还没有完成所有任务' 

msgdict[23005001] = '所需活跃度不足' 

msgdict[23005002] = '已领取此活跃奖励' 

msgdict[24001001] = '当天已签到' 

msgdict[24001002] = '该活动任务未完成，不能领取' 

msgdict[24001003] = '该活动任务已领取，不能重复领取' 

msgdict[24002002] = '非法补签天' 

msgdict[24002003] = '本月补签次数已全部用完' 

msgdict[24002004] = '该天已签到过' 

msgdict[24002005] = '补签卡不足，无法补签' 

msgdict[24005001] = '兑换次数已达上限' 

msgdict[25000001] = '账号长度需要在6-16个字符长度范围内' 

msgdict[25000002] = '密码长度需要在6-16个字符长度范围内' 

msgdict[25000003] = '非法账号类型' 

msgdict[25000004] = '您的账号已注册过' 

msgdict[25000005] = '您的手机已注册过' 

msgdict[25000006] = '您输入的验证码有误' 

msgdict[25000007] = '注册账号不能为纯数字' 

msgdict[25001001] = '您输入的手机号码有误' 

msgdict[25001002] = '您获取验证码速度过快，请稍后再尝试' 

msgdict[25001003] = '今日获取验证码已达到上限' 

msgdict[25001004] = '您的手机还没注册账号' 

msgdict[25001005] = '您的手机已注册过' 

msgdict[25001006] = '您的Ip提交信息过于频繁，无法获取验证码' 

msgdict[25001007] = '发送验证码失败' 

msgdict[25002001] = '您的验证码已失效' 

msgdict[25002002] = '没有这个账号' 

msgdict[25002003] = '密码错误，请重新输入' 

msgdict[25002004] = '您的手机已注册过' 

msgdict[25002005] = '您的手机没有注册过账号' 

msgdict[25003001] = '没有这个账号' 

msgdict[25003002] = '密码错误，请重新输入' 

msgdict[25003003] = '密码长度需要在6-16个字符长度范围内' 

msgdict[25004001] = '密码长度需要在6-16个字符长度范围内' 

msgdict[25004002] = '您的验证码已失效' 

msgdict[25004003] = '您的手机没有注册过账号' 

msgdict[25005001] = '账号长度需要在6-16个字符长度范围内' 

msgdict[25005002] = '密码长度需要在6-16个字符长度范围内' 

msgdict[25005003] = '非法游客账号' 

msgdict[25005004] = '升级输入的账号已注册' 

msgdict[25005005] = '您输入的验证码有误' 

msgdict[25005006] = '只有游客账号才可以升级账号' 

msgdict[25006001] = '没有这个账号' 

msgdict[25006002] = '密码错误，请重新输入' 

msgdict[25006003] = ' 登录信息已过期！' 

msgdict[25006004] = '错误次数过多，请稍后再试！' 

msgdict[25007001] = '验证信息已过期，请重新登录' 

msgdict[25007002] = '验证信息有误，请重新登录' 

msgdict[25007003] = '支持的登录类型' 

msgdict[25007004] = 'data数据异常' 

msgdict[26000001] = '非法招募ID' 

msgdict[26000002] = '已经进行过绑定行为' 

msgdict[26000003] = '该招募令已过期' 

msgdict[26001001] = '已达领取上限，无法继续领取' 

msgdict[26001002] = '没有满足条件，无法领取' 

msgdict[27001001] = '购买物品所需金钱不足' 

msgdict[27001002] = '该物品已被兑换完' 

msgdict[27001003] = '商品不在出售时间段' 

msgdict[28000000] = '活动不在开放时间' 

msgdict[28000001] = '当前没有活动' 

msgdict[28000002] = '等级不足，无法查看排行' 

msgdict[28001001] = '今日已进行过免费抽奖' 

msgdict[28021001] = '还没收集到足够兑换的字' 

msgdict[28042001] = '在线奖励活动，未到领取时间' 

msgdict[28042002] = '今日在线奖励活动已结束' 

msgdict[28061001] = '幸运基金活动已结束' 

msgdict[28062001] = '今天的幸运基金已经抽奖' 

msgdict[28062002] = '幸运基金游戏局数不够' 

msgdict[28062003] = '幸运基金抽奖次数已用完' 

msgdict[28063001] = '幸运基金奖励已领取' 

msgdict[28063002] = '幸运基金抽奖次数不足' 

msgdict[28082001] = '手慢了，红包已经被抢走' 

msgdict[28100001] = '当前活动未完成' 

msgdict[28100002] = '不在活动时间内' 

msgdict[28100003] = '已经领取过奖励' 

msgdict[28100004] = '该活动不存在' 

msgdict[28122001] = '金币不足，无法进行抽奖' 

msgdict[28122002] = '金币不足，无法进行连抽' 

msgdict[28123001] = '所需资源不足，无法刷新奖池' 

msgdict[29001001] = '房间人数已满' 

msgdict[29001002] = 'vip等级不足，无法选座' 

msgdict[29003001] = '只有在榜单上的玩家才能获取奖励' 

msgdict[29003002] = '今日已领取过排行榜奖励' 

msgdict[31001001] = '钻石不足, 无法购买' 

msgdict[31001002] = '该礼包不存在' 

msgdict[31001003] = '购买的不是金币礼包' 

msgdict[30000001] = '疯狂对决今日赢钱已达上限, 请明日再来' 

msgdict[30000002] = '疯狂对决今日输钱已达上限，请明日再来' 

msgdict[30000003] = '金币不足，不能进入游戏' 

msgdict[30002001] = '同时押黑区和红区' 

msgdict[30002002] = '金币不足，无法押注' 

msgdict[30002003] = '总投注额已达庄家上限' 

msgdict[30002004] = '不在押注时间内中' 

msgdict[30002005] = '单区域玩家押注上限3000万' 

msgdict[30002006] = '剩余金币少于可押注的金币限制' 

msgdict[30011001] = '没有足够的金币发送红包' 

msgdict[30013001] = '没有足够的金币发送魔法表情' 

msgdict[600000001] = '房间状态错误，无法操作' 

msgdict[600000002] = '玩家已不在房间，无法操作' 

msgdict[600000003] = '金币不足，无法操作' 

msgdict[600000004] = '非法跟注金币' 

msgdict[600000005] = '不是你的回合，无法操作' 

msgdict[600000006] = '对方已弃牌，无法操作' 

msgdict[600000007] = '金币不足，无法allin' 

msgdict[600000008] = '玩家状态错误，无法操作' 

msgdict[600000009] = '庄家无法上座' 

msgdict[600000010] = '房间还没达到allin条件' 

msgdict[600000011] = '进入房间金币错误' 

msgdict[71000001] = '金币不符合进入房间' 

msgdict[71010001] = '牌局中不能退出房间' 

msgdict[71012001] = '牌局中不能更换房间' 

msgdict[71000002] = '斗地主局数不足时无法进入二人牛牛小游戏' 

msgdict[72000001] = '金币不符合进入房间' 

msgdict[72010001] = '牌局中不能退出房间' 

msgdict[72012001] = '牌局中不能更换房间' 

msgdict[72000002] = '斗地主局数不足时无法进入二人牛牛小游戏' 

msgdict[80005002] = '船长任务中，无法进入房间' 

msgdict[80006004] = '锻造炮台需要的材料不足' 

msgdict[80006005] = '炮倍等级不符无法进入该房间' 

msgdict[80006006] = '炮倍等级不符时点击锻造' 

msgdict[72002] = '火拼牛游戏进行中不可退出' 

msgdict[72003] = '火拼牛游戏进行中不可换桌' 

msgdict[40021] = '进入房间金币不足提示' 

msgdict[40014] = '金币不足提示' 

msgdict[40001] = '玩家不存在' 

msgdict[40002] = '状态不对' 

msgdict[40003] = '桌子未开始' 

msgdict[40004] = '玩家不在桌子上' 

msgdict[40005] = '人数到上限' 

msgdict[40006] = '玩家人数不足' 

msgdict[40007] = '未轮到你操作' 

msgdict[40009] = '手数未到看牌需求' 

msgdict[40010] = '未达到可比牌手数' 

msgdict[40011] = '玩家拒绝比牌' 

msgdict[40015] = '已看牌无法拒绝比牌' 

msgdict[40016] = '超出拒绝比牌次数' 

msgdict[40017] = '金币不满足孤注一掷条件' 

msgdict[40018] = '非法请求' 

msgdict[40019] = '加注' 

msgdict[40020] = '系统错误' 

msgdict[40022] = '全部都是AI' 

msgdict[40025] = '斗地主局数不足时无法进入金花小游戏' 

msgdict[40026] = '金币不满足进入金花房间条件' 

msgdict[40027] = '未准备开始游戏' 

msgdict[41001] = '玩家不存在' 

msgdict[41002] = '状态不对' 

msgdict[41003] = '桌子未开始' 

msgdict[41004] = '玩家不在桌子上' 

msgdict[41005] = '人数到上限' 

msgdict[41006] = '玩家人数不足' 

msgdict[41007] = '未轮到你操作' 

msgdict[41008] = '已有人下注，不能让牌' 

msgdict[41009] = '本轮不能开牌' 

msgdict[41010] = '已经有人下注，不能开牌' 

msgdict[41011] = '已经梭哈了' 

msgdict[41012] = '参数错误' 

msgdict[41013] = '加注超上限了' 

msgdict[41014] = '金币不够' 

msgdict[41015] = '加注次数达到上限了' 

msgdict[41018] = '非法请求' 

msgdict[41019] = '已经有人下注了，不能梭哈' 

msgdict[41020] = '系统错误' 

msgdict[41021] = '金币超系统进入上限' 

msgdict[41023] = '长时间未准备' 

msgdict[80000001] = '进入房间金币错误' 

msgdict[80000002] = '已经进入游戏房间' 

msgdict[80000003] = '该炮倍尚未解锁' 

msgdict[80002001] = '没有足够的炮弹' 

msgdict[80002002] = '非法子弹Id' 

msgdict[80002005] = '比赛未开始，不能发炮' 

msgdict[80003001] = '更换的炮台不存在' 

msgdict[80005001] = '所需资源不足，无法使用当前技能' 

msgdict[80006001] = '技能CD中' 

msgdict[80006002] = '消耗钻石使用技能需达到50倍炮' 

msgdict[80006003] = '鱼潮来临，稍后使用技能' 

msgdict[80006007] = '悬赏任务中不能使用技能' 

msgdict[80006008] = '鱼儿已经挤不下啦，请稍后再试' 

msgdict[81003001] = '百人牛金币不足上座' 

msgdict[81005007] = '百人牛输至最低金币' 

msgdict[81001] = '百人牛牛赢钱上限' 

msgdict[81002] = '百人牛牛输钱上限' 

msgdict[81003] = '百人牛牛入房门槛' 

msgdict[81004] = '百人牛牛上座门槛' 

msgdict[81005] = '上座位置已被抢占' 

msgdict[81006] = '上座错误' 

msgdict[81007] = '已上座' 

msgdict[81008] = '庄家上座' 

msgdict[81009] = '非法押注' 

msgdict[81010] = '金币不足，无法押注' 

msgdict[81011] = '总投注额已达庄家上限' 

msgdict[81012] = '不在押注时间内中' 

msgdict[81013] = '庄家押注' 

msgdict[81014] = '达到区域押注上限' 

msgdict[81015] = '金币不足上庄需求' 

msgdict[81016] = '上装队列已满' 

msgdict[81017] = '已是庄家' 

msgdict[81018] = '携带金币超过上限' 

msgdict[81019] = '已在上庄申请列表' 

msgdict[81020] = '月卡不足' 

msgdict[81021] = '金币不足强制下庄' 

msgdict[81022] = '连庄次数达到自动下庄' 

msgdict[81023] = '金币不足上庄需求取消排队' 

msgdict[81024] = '单区域总押注上限' 

msgdict[81025] = '玩家在这个区域下注达到上限' 

msgdict[81026] = '玩家押注金币不能超过自身剩余金币' 

msgdict[86026] = '玩家押注玉石不能超过自身剩余玉石' 

msgdict[82001] = '红黑赢钱上限' 

msgdict[82002] = '红黑输钱上限' 

msgdict[82003] = '同时押红与黑' 

msgdict[82004] = '金币不足以押注' 

msgdict[82005] = '投注达庄家上限' 

msgdict[82006] = '非押注时间押注' 

msgdict[82007] = '单区域个人押注上限' 

msgdict[82008] = '单区域总押注上限' 

msgdict[82009] = '金币不足以发红包' 

msgdict[82010] = '金币不足以发表情' 

msgdict[82011] = '剩余金币不足以押注' 

msgdict[82012] = '您太久没有进行游戏，已返回大厅！' 

msgdict[82013] = '很抱歉，您需要持有50000金币才能进入' 

msgdict[82014] = '300倍炮开启' 

msgdict[82015] = '本局正在进行中，将在下一局开始前自动退出' 

msgdict[82016] = '已在房间中' 

msgdict[82017] = '很抱歉，您需要持有50000玉石才能进入' 

msgdict[83001] = '操作太频繁' 

msgdict[83002] = '金币不足' 

msgdict[8006004] = '非自由鱼期间不允许召唤船长' 

msgdict[8006005] = '该房间不允许使用该技能' 

msgdict[8006006] = '当前剧本不允许使用该技能' 

msgdict[8006007] = '船长期间不允许使用弹头' 

msgdict[99] = '系统错误' 

msgdict[1] = '钻石不足' 

msgdict[2] = '金币不足' 

msgdict[3] = '奖券不足' 

msgdict[4] = '道具不足' 

msgdict[5] = '网络不佳' 

msgdict[900] = 'SDK签名错误' 

msgdict[901] = '平台订单号为空' 

msgdict[902] = '玩家不存在' 

msgdict[903] = '超时' 

msgdict[10001] = '游戏登录签名错误' 

msgdict[10002] = '角色不存在' 

msgdict[10003] = 'SDK登录校验失败' 

msgdict[10004] = '没有可以供登录的服务器' 

msgdict[10005] = '未配置该SDK' 

msgdict[10006] = '帐号重复登录' 

msgdict[10007] = '注册帐号过多' 

msgdict[10008] = '玩家账号已封号' 

msgdict[11000] = '破产红包不可领' 

msgdict[11001] = '发送验证码失败' 

msgdict[11002] = '验证码校验失败' 

msgdict[11003] = '昵称不合法' 

msgdict[11004] = '免费修改昵称只有一次' 

msgdict[11005] = '头像不存在' 

msgdict[11006] = '头像只能免费修改一次' 

msgdict[11007] = '（绑定手机过多）' 

msgdict[11008] = '（金库）金币不足' 

msgdict[11009] = '（金库）单次存金币数量不足1万' 

msgdict[11010] = '(神秘商人)可领取剩余次数不足' 

msgdict[11011] = '(神秘商人)已领取' 

msgdict[11012] = '实名认证' 

msgdict[11013] = '输钱提示' 

msgdict[11014] = 'VIP等级不足,无法使用特权' 

msgdict[11015] = '(明日礼包)时间还没到，不能领取明日礼包' 

msgdict[11016] = '时间已过期，不能领取明日礼包' 

msgdict[11017] = '已经领取，不能重复领取' 

msgdict[11019] = '修改昵称钻石不足' 

msgdict[12001] = '背包中道具不存在' 

msgdict[12002] = '物品不足' 

msgdict[12003] = '非法目标ID，赠送失败' 

msgdict[12004] = '物品过期' 

msgdict[12005] = '分解绑定数量不足' 

msgdict[12006001] = '购买绑定数量不足' 

msgdict[12006002] = 'vip不足购买号角' 

msgdict[13001] = '邮件已读' 

msgdict[13002] = '邮件不存在' 

msgdict[13003] = '邮件上限' 

msgdict[14001] = '商城道具不存在' 

msgdict[14002] = '首充礼包只能买1次' 

msgdict[14003] = '(神秘商人)商品只能购买一次' 

msgdict[14004] = '猎魔礼包每日限购一次' 

msgdict[15001] = '（好友）好友申请信息过期' 

msgdict[15002] = '好友消息达到上限' 

msgdict[15003] = '好友上限' 

msgdict[15004] = '添加自己为好友' 

msgdict[15005] = '对方已经是好友' 

msgdict[15006] = 'vip等级不足，无法添加好友' 

msgdict[16001] = '（签到）今天已签到' 

msgdict[17001] = '（兑换）材料不足兑换失败' 

msgdict[17002] = '库存不足兑换失败' 

msgdict[17003] = 'SDK处理失败' 

msgdict[17004] = '兑换次数超上限' 

msgdict[18001] = '（夺宝）剩余可购买次数不足' 

msgdict[18002] = '超过每人可购买上限' 

msgdict[18003] = '订单号不存在' 

msgdict[18004] = '已全部卖完，不能在卖出' 

msgdict[18005] = '超出可购买上限' 

msgdict[18007] = '不是领奖状态' 

msgdict[18008] = '中奖人不对' 

msgdict[19000] = '（交易行）交易异常' 

msgdict[19001] = '售卖物品不存在' 

msgdict[19002] = '售卖物品数量不足' 

msgdict[21000] = '（红包广场）红包不存在' 

msgdict[21001] = '该红包无权拆' 

msgdict[21002] = '该红包已经被拆了' 

msgdict[21003] = '大了' 

msgdict[21004] = '小了' 

msgdict[21005] = '超出猜红包的上限次数' 

msgdict[21006] = '好友不存在' 

msgdict[21007] = '红包最小金币1万' 

msgdict[21008] = '剩余金币最小5000' 

msgdict[21009] = '未绑定手机' 

msgdict[17000001] = '未绑定收货地址' 

msgdict[17000002] = '兑换话费京东卡时手机号不能为空' 

msgdict[17000003] = '兑换物品发生异常，请稍后再试' 

msgdict[17000004] = '库存不足，店小二紧急补货中' 

msgdict[23000] = '（小游戏）已经在某个子游戏里了' 

msgdict[24000] = '（活动）活动奖励异常' 

msgdict[24001] = '（兑换码奖励）兑换码错误' 

msgdict[24002] = '玩家已经领取过了' 

msgdict[24003] = '兑换码已过期' 

msgdict[24005] = '活动日充值领取活动币，玩家未进行过充值' 

msgdict[24006] = '活动期间，花费金币购买活动币次数已用完' 

msgdict[24007] = '活动币不足，无法购买' 

msgdict[25001] = '（VIP界面）VIP等级不足' 

msgdict[25002] = 'VIP等级礼包已领取' 

msgdict[88888] = '（大厅模块控制）满足大厅模式控制' 

msgdict[99999] = '（今日头条）满足大厅模式控制' 

msgdict[73000001] = '玩家数据异常' 

msgdict[73000002] = '房间数据异常' 

msgdict[73000003] = '金币不足，不能进入游戏' 

msgdict[73001001] = '房间数据异常' 

msgdict[73001002] = '没有加入该房间' 

msgdict[73001003] = '中途退出游戏' 

msgdict[73002001] = '庄家不可押注' 

msgdict[73002002] = '金币不足' 

msgdict[73002003] = '不在押注状态' 

msgdict[73002004] = '玩家数据异常' 

msgdict[73002005] = '房间数据异常' 

msgdict[73002006] = '配置表数据异常' 

msgdict[73002007] = '单押超出限制时' 

msgdict[73002008] = '进行续押操作，有押注区已经达到限制时' 

msgdict[73002009] = '剩余金币少于可押注的金币限制' 

msgdict[73004001] = '重复申请' 

msgdict[73004002] = '申请列表已达上限' 

msgdict[73004003] = '金币不足' 

msgdict[73004004] = '已经是庄家' 

msgdict[73004005] = '房间数据异常' 

msgdict[73004006] = '玩家数据异常' 

msgdict[73004007] = '配置表数据异常' 

msgdict[73005001] = '连庄次数已达上限' 

msgdict[73005003] = '金币不足，不能成为庄家' 

msgdict[73005004] = '不是庄家' 

msgdict[73005005] = '提前下庄' 

msgdict[73005006] = '没有申请申请' 

msgdict[24004] = '活动已结束' 

msgdict[80000010] = '比赛场没次数或金币不足' 

msgdict[80000011] = '非比赛时间' 

msgdict[80000012] = '号角数量不足，无法进行召唤' 

msgdict[80000013] = '玩家等级不足8级' 

msgdict[80000014] = 'vip等级不足1级' 

msgdict[80000015] = '钻石不足' 

msgdict[80000016] = '技能卡不足' 

msgdict[1400051] = '订单号不存在' 

msgdict[1400052] = '订单已完成' 

msgdict[1400053] = '订单支付失败' 

msgdict[1400054] = '订单状态错误' 

msgdict[12002001] = '玩家当日赠送物品达到上限' 

msgdict[12002002] = '玩家当日接收物品达到上限' 

msgdict[12004001] = '该物品不能出售' 

msgdict[84000001] = '已经开过牌' 

msgdict[84000002] = '开牌的位置错误' 

msgdict[84000003] = '没有游戏实例' 

msgdict[85000001] = '弹头不足，无法夺宝' 

msgdict[85000002] = '玩家不存在' 

msgdict[85000003] = '房间状态错误' 

msgdict[85000004] = '不满足神秘夺宝条件' 

msgdict[85000005] = '话费可发放余额不足' 

msgdict[85000006] = '配置项未找到' 

msgdict[85000007] = '今日神秘夺宝次数已用完' 

msgdict[85000008] = '钻头子弹使用中，无法使用技能' 

msgdict[85000009] = '钻头子弹使用中，禁止换炮' 

msgdict[85000010] = '钻头子弹模式下禁止切换炮倍' 

msgdict[86000001] = '下注区域不存在' 

msgdict[86000002] = '当前状态不允许下注' 

msgdict[86000003] = '金币不足' 

msgdict[86001003] = '玉石不足' 

msgdict[86000004] = '下注不满足最低金币要求' 

msgdict[86001004] = '下注不满足最低玉石要求' 

msgdict[86000005] = '结算后才能离开' 

msgdict[86000006] = '上座需要的金币不足' 

msgdict[86001006] = '上座需要的玉石不足' 

msgdict[86000007] = '座位号错误' 

msgdict[86000008] = '已经坐下了' 

msgdict[86000009] = '庄家不能坐下' 

msgdict[86000010] = '座位已经被占用' 

msgdict[86000011] = '庄家数已满' 

msgdict[86000012] = '庄家不能重复上庄' 

msgdict[86000013] = '上庄最低金额限制' 

msgdict[86000014] = '当前状态不允许下庄' 

msgdict[86000015] = 'vip等级不足' 

msgdict[86000016] = '下注额度达到上限' 

msgdict[86000017] = '庄家不允许下注' 

msgdict[86000018] = '下注使用的筹码不是给定的筹码数额' 

msgdict[86000019] = '玩家每日输赢达到上限' 

msgdict[86000020] = '玩家上庄金币达到上限' 

msgdict[86001020] = '玩家上庄玉石达到上限' 

msgdict[86000021] = '只有庄家才能补庄' 

msgdict[86000022] = '上庄金币数量足够，不需要补庄' 

msgdict[86001022] = '上庄玉石数量足够，不需要补庄' 

msgdict[86001023] = '强化石数量不足，不能锻造' 

msgdict[86000023] = '聊天对象不在游戏内' 

msgdict[86000024] = '只能向座位和庄家玩家发送表情' 

msgdict[86000025] = '进入等级不足' 

msgdict[86000026] = '不能和自己发送互动表情' 

msgdict[86000027] = '上庄金币不足，不能发送互动表情' 

msgdict[86001027] = '上庄玉石不足，不能发送互动表情' 

msgdict[86000028] = '赢提示语（1000万）' 

msgdict[86000029] = '赢提示语（3000万）' 

msgdict[86000030] = '赢提示语（5000万）' 

msgdict[86000031] = '输提示语（1000万）' 

msgdict[86000032] = '输提示语（3000万）' 

msgdict[86000033] = '输提示语（5000万）' 

msgdict[88000001] = 'CD时间未到不能进入小游戏' 

msgdict[80001013] = '上庄最低玉石限制' 

msgdict[90001013] = '上庄最低玉石限制（四国征战）' 

msgdict[90000001] = '下注区域不存在' 

msgdict[90000002] = '当前状态不允许下注' 

msgdict[90000003] = '金币不足' 

msgdict[90001003] = '玉石不足' 

msgdict[90000004] = '下注不满足最低金币要求' 

msgdict[90001004] = '下注不满足最低玉石要求' 

msgdict[90000005] = '结算后才能离开' 

msgdict[90000006] = '上座需要的金币不足' 

msgdict[90001006] = '上座需要的玉石不足' 

msgdict[90000007] = '座位号错误' 

msgdict[90000008] = '已经坐下了' 

msgdict[90000009] = '庄家不能坐下' 

msgdict[90000010] = '座位已经被占用' 

msgdict[90000011] = '庄家数已满' 

msgdict[90000012] = '庄家不能重复上庄' 

msgdict[90000013] = '上庄最低金额限制' 

msgdict[90000014] = '当前状态不允许下注' 

msgdict[90000016] = '下注已达携带上限' 

msgdict[90000017] = '庄家不允许下注' 

msgdict[90000018] = '当前筹码面额不能下注' 

msgdict[90000020] = '上庄最高金币限制' 

msgdict[90001020] = '上庄最高玉石限制' 

msgdict[90000021] = '只有庄家才能补庄' 

msgdict[90000022] = '上庄金币足够不需要补庄' 

msgdict[90001022] = '上庄金币足够不需要补庄' 

msgdict[90000023] = '聊天对象不在游戏内' 

msgdict[90000024] = '只能向座位和庄家玩家发送表情' 

msgdict[90000026] = '不能跟自己聊天' 

msgdict[90000027] = '上庄金币不足，不能发送互动表情' 

msgdict[90001027] = '上庄玉石不足，不能发送互动表情' 

msgdict[90000028] = '押注金币超过限制' 

msgdict[90001028] = '押注玉石超过限制' 

msgdict[31000001] = '不是公会成员' 

msgdict[31000002] = '公会名字已使用，无效' 

msgdict[31000003] = '公会不存在，没有此公会的相关信息' 

msgdict[31000004] = '已加入其他公会，不能再申请' 

msgdict[31000005] = '加入公会时间受限制' 

msgdict[31000006] = '还未创建公会' 

msgdict[31000007] = '没有会长的权限' 

msgdict[31000008] = '图标无效，不合法' 

msgdict[31000009] = '人数已满' 

msgdict[31000010] = '兑换等级不够' 

msgdict[31000011] = '暂无此兑换商品配置' 

msgdict[31000012] = '公会贡献度不够' 

msgdict[31000013] = '不是公会的任务' 

msgdict[31000014] = '任务未完成' 

msgdict[31000015] = '任务奖励已领取' 

msgdict[31000016] = '已是其他公会成员，已加入其他公会' 

msgdict[31000017] = '会长不能退出公会' 

msgdict[31000018] = 'vip等级不够' 

msgdict[31000019] = '钻石不够' 

msgdict[31000020] = '公会名字不合法' 

msgdict[31000021] = '参数错误' 

msgdict[14009001] = '占卜令不足，无法占卜' 

msgdict[14009002] = '今日已使用过该占卜令，明日再来' 

msgdict[14002001] = '您今日消费已超过3000元，请健康游戏，理性消费' 

msgdict[14002002] = '您今日消费已超过5000元，请健康游戏，理性消费' 

msgdict[14002003] = '您今日消费已超过10000元，为了保障您的游戏体验，可能会对您的充值进行限制' 

msgdict[14002004] = '10000元档 不允许充值' 

msgdict[14002005] = '50000元档 允许充值' 

msgdict[14002006] = '50000元档 不允许充值' 

msgdict[14002007] = '100000元档 允许充值' 

msgdict[14002008] = '100000元档 不允许充值' 

msgdict[14002009] = '您还有一笔订单系统正在处理，请稍后再试' 

msgdict[14002010] = '直升礼包过期，无法购买' 

msgdict[31001] = '不满足召唤条件' 

msgdict[31002] = '已召唤，不需要重复召唤' 

msgdict[31003] = '请召唤后再使用' 

msgdict[31004] = '请召唤再升级' 

msgdict[31005] = '满级，不需要再升级' 

msgdict[31006] = '召唤失败' 

msgdict[31007] = '请选择宠物出战后再使用此技能' 

msgdict[31008] = '没有此宠物的信息' 

msgdict[31009] = '宠物技能未使用' 

msgdict[80666001] = '已经绑定过了' 

msgdict[80666002] = '已经到达绑定上限' 

msgdict[80666003] = '已经到达每日兑换上限' 

msgdict[80666004] = '用户不存在' 

msgdict[80666005] = '找不到玩家' 

msgdict[80666006] = '房间内玩家属于钻头子弹状态，暂不能使用号角'
msgdict[80666007] = '绑定口令错误'
msgdict[80666008] = '红包数量不足'
msgdict[80666009] = 'openid错误'
msgdict[999999999] = '未知异常'